Revit 2018 API
UIDocument.CanPlaceElementType Method
 Verifies that the user can be prompted to place the input element type on the current active view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2015
Syntax
C#
public bool CanPlaceElementType(
	ElementType elementType
)
Visual Basic
Public Function CanPlaceElementType ( _
	elementType As ElementType _
) As Boolean
Visual C++
public:
bool CanPlaceElementType(
	ElementType^ elementType
)
Parameters
elementType
Type: Autodesk.Revit.DB.ElementType
 The ElementType.
Return Value
 True if the user can be prompted to place the input element type on the active view, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
UIDocument Class
Autodesk.Revit.UI Namespace